; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star7 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet9)
)
(:goal (and
	(pointing satellite3 Phenomenon14)
	(have_image Planet8 thermograph0)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 spectrograph1)
	(have_image Phenomenon11 spectrograph1)
	(have_image Planet12 thermograph0)
	(have_image Planet13 spectrograph1)
	(have_image Phenomenon14 spectrograph1)
))

)

; plan
1. (turn_to satellite3 groundstation2 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 groundstation2)
   goals met: 0 of 8
2. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite3 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite3 planet12 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet12)
   goals met: 0 of 8
5. (take_image satellite3 planet12 instrument3 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 1 of 8
6. (turn_to satellite3 phenomenon11 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon11)
   goals met: 1 of 8
7. (take_image satellite3 phenomenon11 instrument3 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 2 of 8
8. (turn_to satellite3 phenomenon10 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon10)
   goals met: 2 of 8
9. (take_image satellite3 phenomenon10 instrument3 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 3 of 8
10. (turn_to satellite3 planet13 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 planet13)
   goals met: 3 of 8
11. (take_image satellite3 planet13 instrument3 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 4 of 8
12. (turn_to satellite3 planet8 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet8)
   goals met: 4 of 8
13. (take_image satellite3 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 5 of 8
14. (turn_to satellite3 planet9 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 planet9)
   goals met: 5 of 8
15. (take_image satellite3 planet9 instrument3 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 6 of 8
16. (turn_to satellite3 phenomenon14 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 phenomenon14)
   goals met: 7 of 8
17. (take_image satellite3 phenomenon14 instrument3 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 8 of 8
